experiments/results/thesis/host-NFS-Ceph/MT_2/fio_randwrite_4k_128_1_1.out
"randwrite_4k_128_1": (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=io_uring, iodepth=128
fio-3.28
Starting 1 thread

"randwrite_4k_128_1": (groupid=0, jobs=1): err= 0: pid=78360: Tue Aug  8 22:25:36 2023
  write: IOPS=1591, BW=6367KiB/s (6520kB/s)(373MiB/60052msec); 0 zone resets
    slat (usec): min=2, max=102, avg= 8.35, stdev= 5.65
    clat (msec): min=9, max=149, avg=80.40, stdev=25.29
     lat (msec): min=9, max=149, avg=80.41, stdev=25.29
    clat percentiles (msec):
     |  1.00th=[   38],  5.00th=[   47], 10.00th=[   53], 20.00th=[   60],
     | 30.00th=[   66], 40.00th=[   70], 50.00th=[   75], 60.00th=[   82],
     | 70.00th=[   89], 80.00th=[  100], 90.00th=[  123], 95.00th=[  136],
     | 99.00th=[  142], 99.50th=[  142], 99.90th=[  146], 99.95th=[  146],
     | 99.99th=[  148]
   bw (  KiB/s): min= 3688, max= 9200, per=99.95%, avg=6364.60, stdev=1342.72, samples=120
   iops        : min=  922, max= 2300, avg=1591.13, stdev=335.68, samples=120
  lat (msec)   : 10=0.01%, 50=8.00%, 100=72.47%, 250=19.53%
  cpu          : usr=0.95%, sys=2.03%, ctx=75434, majf=0, minf=0
  IO depths    : 1=0.0%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=99.9%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=0,95586,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: bw=6367KiB/s (6520kB/s), 6367KiB/s-6367KiB/s (6520kB/s-6520kB/s), io=373MiB (392MB), run=60052-60052msec