experiments/results/thesis/host-NFS-Ceph/MT_2/fio_randwrite_4k_16_1_2.out
"randwrite_4k_16_1": (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=io_uring, iodepth=16
fio-3.28
Starting 1 thread

"randwrite_4k_16_1": (groupid=0, jobs=1): err= 0: pid=78253: Tue Aug  8 22:21:02 2023
  write: IOPS=2223, BW=8894KiB/s (9107kB/s)(521MiB/60003msec); 0 zone resets
    slat (nsec): min=2219, max=71370, avg=6192.05, stdev=3805.25
    clat (usec): min=648, max=35374, avg=7188.54, stdev=1984.28
     lat (usec): min=652, max=35383, avg=7194.89, stdev=1984.48
    clat percentiles (usec):
     |  1.00th=[ 1123],  5.00th=[ 2540], 10.00th=[ 4113], 20.00th=[ 6259],
     | 30.00th=[ 7111], 40.00th=[ 7570], 50.00th=[ 7832], 60.00th=[ 8094],
     | 70.00th=[ 8291], 80.00th=[ 8455], 90.00th=[ 8717], 95.00th=[ 8979],
     | 99.00th=[ 9372], 99.50th=[ 9634], 99.90th=[14091], 99.95th=[24773],
     | 99.99th=[28967]
   bw (  KiB/s): min= 7720, max=12360, per=99.99%, avg=8893.57, stdev=1243.26, samples=120
   iops        : min= 1930, max= 3090, avg=2223.38, stdev=310.81, samples=120
  lat (usec)   : 750=0.03%, 1000=0.54%
  lat (msec)   : 2=3.02%, 4=6.06%, 10=90.06%, 20=0.24%, 50=0.06%
  cpu          : usr=0.86%, sys=2.14%, ctx=124864, majf=0, minf=0
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,133396,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
  WRITE: bw=8894KiB/s (9107kB/s), 8894KiB/s-8894KiB/s (9107kB/s-9107kB/s), io=521MiB (546MB), run=60003-60003msec